run/burro8/burro8Atm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontField
    {
        type            patch;
        nFaces          780;
        startFace       429950;
    }
    backField
    {
        type            patch;
        nFaces          780;
        startFace       430730;
    }
    symPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2470;
        startFace       431510;
    }
    sideField
    {
        type            patch;
        nFaces          2470;
        startFace       433980;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11400;
        startFace       436450;
    }
    top
    {
        type            patch;
        nFaces          11400;
        startFace       447850;
    }
)

// ************************************************************************* //
