run/burro8/burro8Atm/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/data/ablParams"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $temGround;

boundaryField
{
    frontField
    {
        type            fixedProfile;
        profile         csvFile;
        profileCoeffs
        {
            nHeaderLine         0;
            refColumn           0;  
            componentColumns    (1); 
            mergeSeparators     no;         
            file                "$FOAM_CASE/data/Tem.csv";
            outOfBounds         clamp;
            interpolationScheme linear;
        }
        direction        (0 0 1);
        origin           0;
    }
    backField
    {   
        type            zeroGradient;
    }   
    sideField
    {   
        type            zeroGradient;
    }   
    top 
    {   
        type            zeroGradient;
    }
    ground
    {
        type            externalWallHeatFluxTemperature;
        mode            flux;
        q               uniform $groundHeatFlux;
        kappaMethod     fluidThermo;
        value           $internalField;
    }
    symPlane
    {
        type            symmetryPlane;
    }
}
// ************************************************************************* //
